hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83848/hpm_dp83848_regs.h
/*
 * Copyright (c) 2021-2022 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_DP83848_REGS_H
#define HPM_DP83848_REGS_H

typedef enum {
    DP83848_BMCR                        = 0,   /* 0x0: Basic Mode Control Register */
    DP83848_BMSR                        = 1,   /* 0x1: Basic Mode Status Register */
    DP83848_PHYIDR1                     = 2,   /* 0x2: PHY Identifier Register #1 */
    DP83848_PHYIDR2                     = 3,   /* 0x3: PHY Identifier Register #2 */
    DP83848_ANAR                        = 4,   /* 0x4: Auto-Negotiation Advertisement Register */
    DP83848_ANLPAR_BP                   = 5,   /* 0x5: Auto-Negotiation Link Partner Ability Register */
    DP83848_ANER                        = 6,   /* 0x6: Auto-Negotiate Expansion Register */
    DP83848_ANNPTR                      = 7,   /* 0x7: Auto-Negotiation Next Page Transmit Register */
    DP83848_PHYSTS                      = 16,  /* 0x10: PHY Status Register */
    DP83848_FCSCR                       = 20,  /* 0x14: False Carrier Sense Counter Register */
    DP83848_RECR                        = 21,  /* 0x15: Receiver Error Counter Register */
    DP83848_PCSR                        = 22,  /* 0x16: 100 Mb/s PCS Configuration and Status Register */
    DP83848_RBR                         = 23,  /* 0x17: RMII and Bypass Register */
    DP83848_LEDCR                       = 24,  /* 0x18: LED Direct Control Register */
    DP83848_PHYCR                       = 25,  /* 0x19: PHY Control Register */
    DP83848_10BTSCR                     = 26,  /* 0x1A: 10BASE-T Status/Control Register */
    DP83848_CDCTRL1                     = 27,  /* 0x1B: CD Test and BIST Extensions Register */
    DP83848_EDCR                        = 29,  /* 0x1D: Energy Detect Control */
} DP83848_REG_Type;


/* Bitfield definition for register: BMCR */
/*
 * RESET (RW/SC)
 *
 * Reset:
 * 1 = Initiate software Reset / Reset in Process.
 * 0 = Normal operation.
 * This bit, which is self-clearing, returns a value of one until the reset process is complete. The
 * configuration is re-strapped.
 */
#define DP83848_BMCR_RESET_MASK (0x8000U)
#define DP83848_BMCR_RESET_SHIFT (15U)
#define DP83848_BMCR_RESET_SET(x) (((uint16_t)(x) << DP83848_BMCR_RESET_SHIFT) & DP83848_BMCR_RESET_MASK)
#define DP83848_BMCR_RESET_GET(x) (((uint16_t)(x) & DP83848_BMCR_RESET_MASK) >> DP83848_BMCR_RESET_SHIFT)

/*
 * LOOPBACK (RW)
 *
 * Loopback:
 * 1 = Loopback enabled.
 * 0 = Normal operation.
 * The loopback function enables MII transmit data to be routed to the MII receive data path.
 * Setting this bit may cause the descrambler to lose synchronization and produce a 500 µs “dead
 * time” before any valid data will appear at the MII receive outputs.
 */
#define DP83848_BMCR_LOOPBACK_MASK (0x4000U)
#define DP83848_BMCR_LOOPBACK_SHIFT (14U)
#define DP83848_BMCR_LOOPBACK_SET(x) (((uint16_t)(x) << DP83848_BMCR_LOOPBACK_SHIFT) & DP83848_BMCR_LOOPBACK_MASK)
#define DP83848_BMCR_LOOPBACK_GET(x) (((uint16_t)(x) & DP83848_BMCR_LOOPBACK_MASK) >> DP83848_BMCR_LOOPBACK_SHIFT)

/*
 * SPEED0 (RW)
 *
 * Speed Select:
 * When auto-negotiation is disabled writing to this bit allows the port speed to be selected.
 * 1 = 100 Mb/s.
 * 0 = 10 Mb/s.
 */
#define DP83848_BMCR_SPEED0_MASK (0x2000U)
#define DP83848_BMCR_SPEED0_SHIFT (13U)
#define DP83848_BMCR_SPEED0_SET(x) (((uint16_t)(x) << DP83848_BMCR_SPEED0_SHIFT) & DP83848_BMCR_SPEED0_MASK)
#define DP83848_BMCR_SPEED0_GET(x) (((uint16_t)(x) & DP83848_BMCR_SPEED0_MASK) >> DP83848_BMCR_SPEED0_SHIFT)

/*
 * ANE (RW)
 *
 * Auto-Negotiation Enable:
 * Strap controls initial value at reset.
 * 1 = Auto-Negotiation Enabled - bits 8 and 13 of this register are ignored when this bit is set.
 * 0 = Auto-Negotiation Disabled - bits 8 and 13 determine the port speed and duplex mode.
 */
#define DP83848_BMCR_ANE_MASK (0x1000U)
#define DP83848_BMCR_ANE_SHIFT (12U)
#define DP83848_BMCR_ANE_SET(x) (((uint16_t)(x) << DP83848_BMCR_ANE_SHIFT) & DP83848_BMCR_ANE_MASK)
#define DP83848_BMCR_ANE_GET(x) (((uint16_t)(x) & DP83848_BMCR_ANE_MASK) >> DP83848_BMCR_ANE_SHIFT)

/*
 * PWD (RW)
 *
 * Power Down:
 * 1 = Power down.
 * 0 = Normal operation.
 * Setting this bit powers down the PHY. Only the register block is enabled during a power-down
 * condition.
 */
#define DP83848_BMCR_PWD_MASK (0x800U)
#define DP83848_BMCR_PWD_SHIFT (11U)
#define DP83848_BMCR_PWD_SET(x) (((uint16_t)(x) << DP83848_BMCR_PWD_SHIFT) & DP83848_BMCR_PWD_MASK)
#define DP83848_BMCR_PWD_GET(x) (((uint16_t)(x) & DP83848_BMCR_PWD_MASK) >> DP83848_BMCR_PWD_SHIFT)

/*
 * ISOLATE (RW)
 *
 * Isolate:
 * 1 = Isolates the Port from the MII with the exception of the serial management.
 * 0 = Normal operation.
 */
#define DP83848_BMCR_ISOLATE_MASK (0x400U)
#define DP83848_BMCR_ISOLATE_SHIFT (10U)
#define DP83848_BMCR_ISOLATE_SET(x) (((uint16_t)(x) << DP83848_BMCR_ISOLATE_SHIFT) & DP83848_BMCR_ISOLATE_MASK)
#define DP83848_BMCR_ISOLATE_GET(x) (((uint16_t)(x) & DP83848_BMCR_ISOLATE_MASK) >> DP83848_BMCR_ISOLATE_SHIFT)

/*
 * RESTART_AN (RW/SC)
 *
 * Restart Auto-Negotiation:
 * 1 = Restart Auto-Negotiation. Re-initiates the Auto-Negotiation process. If Auto-Negotiation is
 * disabled (bit 12 = 0), this bit is ignored. This bit is self-clearing and will return a value of 1 until
 * Auto-Negotiation is initiated, whereupon it will self-clear. Operation of the Auto-Negotiation
 * process is not affected by the management entity clearing this bit.
 * 0 = Normal operation.
 */
#define DP83848_BMCR_RESTART_AN_MASK (0x200U)
#define DP83848_BMCR_RESTART_AN_SHIFT (9U)
#define DP83848_BMCR_RESTART_AN_SET(x) (((uint16_t)(x) << DP83848_BMCR_RESTART_AN_SHIFT) & DP83848_BMCR_RESTART_AN_MASK)
#define DP83848_BMCR_RESTART_AN_GET(x) (((uint16_t)(x) & DP83848_BMCR_RESTART_AN_MASK) >> DP83848_BMCR_RESTART_AN_SHIFT)

/*
 * DUPLEX (RW)
 *
 * Duplex Mode:
 * When auto-negotiation is disabled writing to this bit allows the port Duplex capability to be
 * selected.
 * 1 = Full Duplex operation.
 * 0 = Half Duplex operation.
 */
#define DP83848_BMCR_DUPLEX_MASK (0x100U)
#define DP83848_BMCR_DUPLEX_SHIFT (8U)
#define DP83848_BMCR_DUPLEX_SET(x) (((uint16_t)(x) << DP83848_BMCR_DUPLEX_SHIFT) & DP83848_BMCR_DUPLEX_MASK)
#define DP83848_BMCR_DUPLEX_GET(x) (((uint16_t)(x) & DP83848_BMCR_DUPLEX_MASK) >> DP83848_BMCR_DUPLEX_SHIFT)

