hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83848/hpm_dp83848_regs.h
/*
 * COLLISION_TEST (RW)
 *
 * Collision Test:
 * 1 = Collision test enabled.
 * 0 = Normal operation.
 * When set, this bit will cause the COL signal to be asserted in response to the assertion of
 * TX_EN within 512-bit times. The COL signal will be deasserted within 4-bit times in response to
 * the deassertion of TX_EN.
 */
#define DP83848_BMCR_COLLISION_TEST_MASK (0x80U)
#define DP83848_BMCR_COLLISION_TEST_SHIFT (7U)
#define DP83848_BMCR_COLLISION_TEST_SET(x) (((uint16_t)(x) << DP83848_BMCR_COLLISION_TEST_SHIFT) & DP83848_BMCR_COLLISION_TEST_MASK)
#define DP83848_BMCR_COLLISION_TEST_GET(x) (((uint16_t)(x) & DP83848_BMCR_COLLISION_TEST_MASK) >> DP83848_BMCR_COLLISION_TEST_SHIFT)

/* Bitfield definition for register: BMSR */
/*
 * 100BASE_TX_FULL_DUPLEX (RO)
 *
 * 100BASE-TX Full Duplex Capable:
 * 1 = Device able to perform 100BASE-TX in full duplex mode.
 */
#define DP83848_BMSR_100BASE_TX_FULL_DUPLEX_MASK (0x4000U)
#define DP83848_BMSR_100BASE_TX_FULL_DUPLEX_SHIFT (14U)
#define DP83848_BMSR_100BASE_TX_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83848_BMSR_100BASE_TX_FULL_DUPLEX_MASK) >> DP83848_BMSR_100BASE_TX_FULL_DUPLEX_SHIFT)

/*
 * 100BASE_TX_HALF (RO)
 *
 * 100BASE-TX Half Duplex Capable:
 * 1 = Device able to perform 100BASE-TX in half duplex mode.
 */
#define DP83848_BMSR_100BASE_TX_HALF_MASK (0x2000U)
#define DP83848_BMSR_100BASE_TX_HALF_SHIFT (13U)
#define DP83848_BMSR_100BASE_TX_HALF_GET(x) (((uint16_t)(x) & DP83848_BMSR_100BASE_TX_HALF_MASK) >> DP83848_BMSR_100BASE_TX_HALF_SHIFT)

/*
 * 10BASE_T_FULL_DUPLEX (RO)
 *
 * 10BASE-T Full Duplex Capable:
 * 1 = Device able to perform 10BASE-T in full duplex mode.
 */
#define DP83848_BMSR_10BASE_T_FULL_DUPLEX_MASK (0x1000U)
#define DP83848_BMSR_10BASE_T_FULL_DUPLEX_SHIFT (12U)
#define DP83848_BMSR_10BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83848_BMSR_10BASE_T_FULL_DUPLEX_MASK) >> DP83848_BMSR_10BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 10BASE_T_HALF_DUPLEX (RO)
 *
 * 10BASE-T Half Duplex Capable:
 * 1 = Device able to perform 10BASE-T in half duplex mode.
 */
#define DP83848_BMSR_10BASE_T_HALF_DUPLEX_MASK (0x800U)
#define DP83848_BMSR_10BASE_T_HALF_DUPLEX_SHIFT (11U)
#define DP83848_BMSR_10BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83848_BMSR_10BASE_T_HALF_DUPLEX_MASK) >> DP83848_BMSR_10BASE_T_HALF_DUPLEX_SHIFT)

/*
 * MF_PREAMBLE_SUPPRESSION (RO)
 *
 * Preamble suppression Capable:
 * 1 = Device able to perform management transaction with preamble suppressed, 32-bits of
 * preamble needed only once after reset, invalid opcode or invalid turnaround.
 * 0 = Normal management operation.
 */
#define DP83848_BMSR_MF_PREAMBLE_SUPPRESSION_MASK (0x40U)
#define DP83848_BMSR_MF_PREAMBLE_SUPPRESSION_SHIFT (6U)
#define DP83848_BMSR_MF_PREAMBLE_SUPPRESSION_GET(x) (((uint16_t)(x) & DP83848_BMSR_MF_PREAMBLE_SUPPRESSION_MASK) >> DP83848_BMSR_MF_PREAMBLE_SUPPRESSION_SHIFT)

/*
 * AUTO_NEGOTIATION_COMPLETE (RO)
 *
 * Auto-Negotiation Complete:
 * 1 = Auto-Negotiation process complete.
 * 0 = Auto-Negotiation process not complete.
 */
#define DP83848_BMSR_AUTO_NEGOTIATION_COMPLETE_MASK (0x20U)
#define DP83848_BMSR_AUTO_NEGOTIATION_COMPLETE_SHIFT (5U)
#define DP83848_BMSR_AUTO_NEGOTIATION_COMPLETE_GET(x) (((uint16_t)(x) & DP83848_BMSR_AUTO_NEGOTIATION_COMPLETE_MASK) >> DP83848_BMSR_AUTO_NEGOTIATION_COMPLETE_SHIFT)

/*
 * REMOTE_FAULT (RO)
 *
 * Remote Fault:
 * 1 = Remote Fault condition detected (cleared on read or by reset). Fault criteria: Notification from
 * Link Partner of Remote Fault.
 * 0 = No remote fault condition detected.
 */
#define DP83848_BMSR_REMOTE_FAULT_MASK (0x10U)
#define DP83848_BMSR_REMOTE_FAULT_SHIFT (4U)
#define DP83848_BMSR_REMOTE_FAULT_GET(x) (((uint16_t)(x) & DP83848_BMSR_REMOTE_FAULT_MASK) >> DP83848_BMSR_REMOTE_FAULT_SHIFT)

/*
 * AUTO_NEGOTIATION_ABILITY (RO)
 *
 * Auto Negotiation Ability:
 * 1 = Device is able to perform Auto-Negotiation.
 * 0 = Device is not able to perform Auto-Negotiation.
 */
#define DP83848_BMSR_AUTO_NEGOTIATION_ABILITY_MASK (0x8U)
#define DP83848_BMSR_AUTO_NEGOTIATION_ABILITY_SHIFT (3U)
#define DP83848_BMSR_AUTO_NEGOTIATION_ABILITY_GET(x) (((uint16_t)(x) & DP83848_BMSR_AUTO_NEGOTIATION_ABILITY_MASK) >> DP83848_BMSR_AUTO_NEGOTIATION_ABILITY_SHIFT)

/*
 * LINK_STATUS (RO)
 *
 * Link Status:
 * 1 = Valid link established (for either 10 or 100 Mb/s operation).
 * 0 = Link not established.
 * The criteria for link validity is implementation specific. The occurrence of a link failure condition
 * will causes the Link Status bit to clear. Once cleared, this bit may only be set by establishing a
 * good link condition and a read through the management interface.
 */
#define DP83848_BMSR_LINK_STATUS_MASK (0x4U)
#define DP83848_BMSR_LINK_STATUS_SHIFT (2U)
#define DP83848_BMSR_LINK_STATUS_GET(x) (((uint16_t)(x) & DP83848_BMSR_LINK_STATUS_MASK) >> DP83848_BMSR_LINK_STATUS_SHIFT)

/*
 * JABBER_DETECT (RO)
 *
 * Jabber Detect: This bit only has meaning in 10 Mb/s mode.
 * 1 = Jabber condition detected.
 * 0 = No Jabber.
 * This bit is implemented with a latching function, such that the occurrence of a jabber condition
 * causes it to set until it is cleared by a read to this register by the management interface or by a
 * reset.
 */
#define DP83848_BMSR_JABBER_DETECT_MASK (0x2U)
#define DP83848_BMSR_JABBER_DETECT_SHIFT (1U)
#define DP83848_BMSR_JABBER_DETECT_GET(x) (((uint16_t)(x) & DP83848_BMSR_JABBER_DETECT_MASK) >> DP83848_BMSR_JABBER_DETECT_SHIFT)

/*
 * EXTENDED_CAPABILITY (RO)
 *
 * Extended Capability:
 * 1 = Extended register capabilities.
 * 0 = Basic register set capabilities only.
 */
#define DP83848_BMSR_EXTENDED_CAPABILITY_MASK (0x1U)
#define DP83848_BMSR_EXTENDED_CAPABILITY_SHIFT (0U)
#define DP83848_BMSR_EXTENDED_CAPABILITY_GET(x) (((uint16_t)(x) & DP83848_BMSR_EXTENDED_CAPABILITY_MASK) >> DP83848_BMSR_EXTENDED_CAPABILITY_SHIFT)

/* Bitfield definition for register: PHYIDR1 */
/*
 * OUI_MSB (RO)
 *
 * OUI Most Significant Bits:
 * Bits 3 to 18 of the OUI (080017h) are stored in bits 15 to 0 of this register. The most
 * significant two bits of the OUI are ignored (the IEEE standard refers to these as bits 1 and
 * 2).
 */
#define DP83848_PHYIDR1_OUI_MSB_MASK (0xFFFFU)
#define DP83848_PHYIDR1_OUI_MSB_SHIFT (0U)
#define DP83848_PHYIDR1_OUI_MSB_GET(x) (((uint16_t)(x) & DP83848_PHYIDR1_OUI_MSB_MASK) >> DP83848_PHYIDR1_OUI_MSB_SHIFT)

