hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83848/hpm_dp83848_regs.h
/*
 * MP (RW)
 *
 * Message Page:
 * 1 = Message Page.
 * 0 = Unformatted Page.
 */
#define DP83848_ANNPTR_MP_MASK (0x2000U)
#define DP83848_ANNPTR_MP_SHIFT (13U)
#define DP83848_ANNPTR_MP_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_MP_SHIFT) & DP83848_ANNPTR_MP_MASK)
#define DP83848_ANNPTR_MP_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_MP_MASK) >> DP83848_ANNPTR_MP_SHIFT)

/*
 * ACK2 (RW)
 *
 * Acknowledge2:
 * 1 = Will comply with message.
 * 0 = Cannot comply with message.
 * Acknowledge2 is used by the next page function to indicate that Local Device has the ability
 * to comply with the message received.
 */
#define DP83848_ANNPTR_ACK2_MASK (0x1000U)
#define DP83848_ANNPTR_ACK2_SHIFT (12U)
#define DP83848_ANNPTR_ACK2_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_ACK2_SHIFT) & DP83848_ANNPTR_ACK2_MASK)
#define DP83848_ANNPTR_ACK2_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_ACK2_MASK) >> DP83848_ANNPTR_ACK2_SHIFT)

/*
 * TOG_TX (RW)
 *
 * Toggle:
 * 1 = Value of toggle bit in previously transmitted Link Code Word was 0.
 * 0 = Value of toggle bit in previously transmitted Link Code Word was 1.
 * Toggle is used by the Arbitration function within Auto-Negotiation to ensure synchronization
 * with the Link Partner during Next Page exchange. This bit shall always take the opposite
 * value of the Toggle bit in the previously exchanged Link Code Word.
 */
#define DP83848_ANNPTR_TOG_TX_MASK (0x800U)
#define DP83848_ANNPTR_TOG_TX_SHIFT (11U)
#define DP83848_ANNPTR_TOG_TX_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_TOG_TX_SHIFT) & DP83848_ANNPTR_TOG_TX_MASK)
#define DP83848_ANNPTR_TOG_TX_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_TOG_TX_MASK) >> DP83848_ANNPTR_TOG_TX_SHIFT)

/*
 * CODE (RW)
 *
 * This field represents the code field of the next page transmission. If the MP bit is set (bit 13
 * of this register), then the code shall be interpreted as a "Message Page”, as defined in annex
 * 28C of IEEE 802.3. Otherwise, the code shall be interpreted as an "Unformatted Page”, and
 * the interpretation is application specific.
 * The default value of the CODE represents a Null Page as defined in Annex 28C of IEEE
 * 802.3.
 */
#define DP83848_ANNPTR_CODE_MASK (0x400U)
#define DP83848_ANNPTR_CODE_SHIFT (10U)
#define DP83848_ANNPTR_CODE_SET(x) (((uint16_t)(x) << DP83848_ANNPTR_CODE_SHIFT) & DP83848_ANNPTR_CODE_MASK)
#define DP83848_ANNPTR_CODE_GET(x) (((uint16_t)(x) & DP83848_ANNPTR_CODE_MASK) >> DP83848_ANNPTR_CODE_SHIFT)

/* Bitfield definition for register: PHYSTS */
/*
 * MDI_X_MODE (RO)
 *
 * MDI-X mode as reported by the Auto-Negotiation logic:
 * This bit will be affected by the settings of the MDIX_EN and FORCE_MDIX bits in the
 * PHYCR register. When MDIX is enabled, but not forced, this bit will update dynamically as
 * the Auto-MDIX algorithm swaps between MDI and MDI-X configurations.
 * 1 = MDI pairs swapped (Receive on TPTD pair, Transmit on TPRD pair)
 * 0 = MDI pairs normal (Receive on TRD pair, Transmit on TPTD pair)
 */
#define DP83848_PHYSTS_MDI_X_MODE_MASK (0x4000U)
#define DP83848_PHYSTS_MDI_X_MODE_SHIFT (14U)
#define DP83848_PHYSTS_MDI_X_MODE_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_MDI_X_MODE_MASK) >> DP83848_PHYSTS_MDI_X_MODE_SHIFT)

/*
 * RECEIVE_ERRORLATCH (RO)
 *
 * Receive Error Latch:
 * This bit will be cleared upon a read of the RECR register.
 * 1 = Receive error event has occurred since last read of RXERCNT (address 0x15, Page 0).
 * 0 = No receive error event has occurred.
 */
#define DP83848_PHYSTS_RECEIVE_ERRORLATCH_MASK (0x2000U)
#define DP83848_PHYSTS_RECEIVE_ERRORLATCH_SHIFT (13U)
#define DP83848_PHYSTS_RECEIVE_ERRORLATCH_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_RECEIVE_ERRORLATCH_MASK) >> DP83848_PHYSTS_RECEIVE_ERRORLATCH_SHIFT)

/*
 * POLARITY_STATUS (RO)
 *
 * Polarity Status:
 * This bit is a duplication of bit 4 in the 10BTSCR register. This bit will be cleared upon a read
 * of the 10BTSCR register, but not upon a read of the PHYSTS register.
 * 1 = Inverted Polarity detected.
 * 0 = Correct Polarity detected.
 */
#define DP83848_PHYSTS_POLARITY_STATUS_MASK (0x1000U)
#define DP83848_PHYSTS_POLARITY_STATUS_SHIFT (12U)
#define DP83848_PHYSTS_POLARITY_STATUS_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_POLARITY_STATUS_MASK) >> DP83848_PHYSTS_POLARITY_STATUS_SHIFT)

/*
 * FALSE_CARRIER_SENSE_LATCH (RO)
 *
 * False Carrier Sense Latch:
 * This bit will be cleared upon a read of the FCSR register.
 * 1 = False Carrier event has occurred since last read of FCSCR (address 0x14).
 * 0 = No False Carrier event has occurred.
 */
#define DP83848_PHYSTS_FALSE_CARRIER_SENSE_LATCH_MASK (0x800U)
#define DP83848_PHYSTS_FALSE_CARRIER_SENSE_LATCH_SHIFT (11U)
#define DP83848_PHYSTS_FALSE_CARRIER_SENSE_LATCH_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_FALSE_CARRIER_SENSE_LATCH_MASK) >> DP83848_PHYSTS_FALSE_CARRIER_SENSE_LATCH_SHIFT)

/*
 * SIGNAL_DETECT (RO)
 *
 * 100Base-TX unconditional Signal Detect from PMD.
 */
#define DP83848_PHYSTS_SIGNAL_DETECT_MASK (0x400U)
#define DP83848_PHYSTS_SIGNAL_DETECT_SHIFT (10U)
#define DP83848_PHYSTS_SIGNAL_DETECT_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_SIGNAL_DETECT_MASK) >> DP83848_PHYSTS_SIGNAL_DETECT_SHIFT)

/*
 * DESCRAMBLER_LOCK (RO)
 *
 * 100Base-TX Descrambler Lock from PMD.
 */
#define DP83848_PHYSTS_DESCRAMBLER_LOCK_MASK (0x200U)
#define DP83848_PHYSTS_DESCRAMBLER_LOCK_SHIFT (9U)
#define DP83848_PHYSTS_DESCRAMBLER_LOCK_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_DESCRAMBLER_LOCK_MASK) >> DP83848_PHYSTS_DESCRAMBLER_LOCK_SHIFT)

/*
 * PAGE_RECEIVED (RO)
 *
 * Link Code Word Page Received:
 * This is a duplicate of the Page Received bit in the ANER register, but this bit will not be
 * cleared upon a read of the PHYSTS register.
 * 1 = A new Link Code Word Page has been received. Cleared on read of the ANER (address
 * 0x06, bit 1).
 * 0 = Link Code Word Page has not been received.
 */
#define DP83848_PHYSTS_PAGE_RECEIVED_MASK (0x100U)
#define DP83848_PHYSTS_PAGE_RECEIVED_SHIFT (8U)
#define DP83848_PHYSTS_PAGE_RECEIVED_GET(x) (((uint16_t)(x) & DP83848_PHYSTS_PAGE_RECEIVED_MASK) >> DP83848_PHYSTS_PAGE_RECEIVED_SHIFT)

