hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83848/hpm_dp83848_regs.h
/*
 * DESC_TIME (RW)
 *
 * Descrambler Timeout:
 * Increase the descrambler timeout. When set this should allow the device to receive larger
 * packets (>9k bytes) without loss of synchronization.
 * 1 = 2ms
 * 0 = 722us (per ANSI X3.263: 1995 (TP-PMD) 7.2.3.3e)
 */
#define DP83848_PCSR_DESC_TIME_MASK (0x80U)
#define DP83848_PCSR_DESC_TIME_SHIFT (7U)
#define DP83848_PCSR_DESC_TIME_SET(x) (((uint16_t)(x) << DP83848_PCSR_DESC_TIME_SHIFT) & DP83848_PCSR_DESC_TIME_MASK)
#define DP83848_PCSR_DESC_TIME_GET(x) (((uint16_t)(x) & DP83848_PCSR_DESC_TIME_MASK) >> DP83848_PCSR_DESC_TIME_SHIFT)

/*
 * FORCE_100_OK (RW)
 *
 * Force 100Mb/s Good Link:
 * 1 = Forces 100Mb/s Good Link.
 * 0 = Normal 100Mb/s operation.
 */
#define DP83848_PCSR_FORCE_100_OK_MASK (0x20U)
#define DP83848_PCSR_FORCE_100_OK_SHIFT (5U)
#define DP83848_PCSR_FORCE_100_OK_SET(x) (((uint16_t)(x) << DP83848_PCSR_FORCE_100_OK_SHIFT) & DP83848_PCSR_FORCE_100_OK_MASK)
#define DP83848_PCSR_FORCE_100_OK_GET(x) (((uint16_t)(x) & DP83848_PCSR_FORCE_100_OK_MASK) >> DP83848_PCSR_FORCE_100_OK_SHIFT)

/*
 * NRZI_BYPASS (RW)
 *
 * NRZI Bypass Enable:
 * 1 = NRZI Bypass Enabled.
 * 0 = NRZI Bypass Disabled.
 */
#define DP83848_PCSR_NRZI_BYPASS_MASK (0x4U)
#define DP83848_PCSR_NRZI_BYPASS_SHIFT (2U)
#define DP83848_PCSR_NRZI_BYPASS_SET(x) (((uint16_t)(x) << DP83848_PCSR_NRZI_BYPASS_SHIFT) & DP83848_PCSR_NRZI_BYPASS_MASK)
#define DP83848_PCSR_NRZI_BYPASS_GET(x) (((uint16_t)(x) & DP83848_PCSR_NRZI_BYPASS_MASK) >> DP83848_PCSR_NRZI_BYPASS_SHIFT)

/* Bitfield definition for register: RBR */
/*
 * RMII_MODE (RW)
 *
 * Reduced MII Mode:
 * 0 = Standard MII Mode
 * 1 = Reduced MII Mode
 */
#define DP83848_RBR_RMII_MODE_MASK (0x20U)
#define DP83848_RBR_RMII_MODE_SHIFT (5U)
#define DP83848_RBR_RMII_MODE_SET(x) (((uint16_t)(x) << DP83848_RBR_RMII_MODE_SHIFT) & DP83848_RBR_RMII_MODE_MASK)
#define DP83848_RBR_RMII_MODE_GET(x) (((uint16_t)(x) & DP83848_RBR_RMII_MODE_MASK) >> DP83848_RBR_RMII_MODE_SHIFT)

/*
 * RMII_REV1_0 (RW)
 *
 * Reduce MII Revision 1.0:
 * 0 = (RMII revision 1.2) CRS_DV will toggle at the end of a packet to indicate deassertion of
 * CRS.
 * 1 = (RMII revision 1.0) CRS_DV will remain asserted until final data is transferred. CRS_DV
 * will not toggle at the end of a packet.
 */
#define DP83848_RBR_RMII_REV1_0_MASK (0x10U)
#define DP83848_RBR_RMII_REV1_0_SHIFT (4U)
#define DP83848_RBR_RMII_REV1_0_SET(x) (((uint16_t)(x) << DP83848_RBR_RMII_REV1_0_SHIFT) & DP83848_RBR_RMII_REV1_0_MASK)
#define DP83848_RBR_RMII_REV1_0_GET(x) (((uint16_t)(x) & DP83848_RBR_RMII_REV1_0_MASK) >> DP83848_RBR_RMII_REV1_0_SHIFT)

/*
 * RX_OVF_STS (RO)
 *
 * RX FIFO Over Flow Status:
 * 0 = Normal
 * 1 = Overflow detected
 */
#define DP83848_RBR_RX_OVF_STS_MASK (0x8U)
#define DP83848_RBR_RX_OVF_STS_SHIFT (3U)
#define DP83848_RBR_RX_OVF_STS_GET(x) (((uint16_t)(x) & DP83848_RBR_RX_OVF_STS_MASK) >> DP83848_RBR_RX_OVF_STS_SHIFT)

/*
 * RX_UNF_STS (RO)
 *
 * RX FIFO Under Flow Status:
 * 0 = Normal
 * 1 = Underflow detected
 */
#define DP83848_RBR_RX_UNF_STS_MASK (0x4U)
#define DP83848_RBR_RX_UNF_STS_SHIFT (2U)
#define DP83848_RBR_RX_UNF_STS_GET(x) (((uint16_t)(x) & DP83848_RBR_RX_UNF_STS_MASK) >> DP83848_RBR_RX_UNF_STS_SHIFT)

/*
 * ELAST_BUF_1_0 (RW)
 *
 * Receive Elasticity Buffer. This field controls the Receive Elasticity Buffer which allows for
 * frequency variation tolerance between the 50-MHz RMII clock and the recovered data. The
 * following value indicate the tolerance in bits for a single packet. The minimum setting allows
 * for standard Ethernet frame sizes at ±50 ppm accuracy for both RMII and Receive clocks. For
 * greater frequency tolerance the packet lengths may be scaled (that is, for ±100 ppm, the
 * packet lengths need to be divided by 2).
 * 00 = 14 bit tolerance (up to 16800 byte packets)
 * 01 = 2 bit tolerance (up to 2400 byte packets)
 * 10 = 6 bit tolerance (up to 7200 byte packets)
 * 11 = 10 bit tolerance (up to 12000 byte packets)
 */
#define DP83848_RBR_ELAST_BUF_1_0_MASK (0x3U)
#define DP83848_RBR_ELAST_BUF_1_0_SHIFT (0U)
#define DP83848_RBR_ELAST_BUF_1_0_SET(x) (((uint16_t)(x) << DP83848_RBR_ELAST_BUF_1_0_SHIFT) & DP83848_RBR_ELAST_BUF_1_0_MASK)
#define DP83848_RBR_ELAST_BUF_1_0_GET(x) (((uint16_t)(x) & DP83848_RBR_ELAST_BUF_1_0_MASK) >> DP83848_RBR_ELAST_BUF_1_0_SHIFT)

/* Bitfield definition for register: LEDCR */
/*
 * DRV_SPDLED (RW)
 *
 * 1 = Drive value of SPDLED bit onto LED_SPEED output
 * 0 = Normal operation
 */
#define DP83848_LEDCR_DRV_SPDLED_MASK (0x20U)
#define DP83848_LEDCR_DRV_SPDLED_SHIFT (5U)
#define DP83848_LEDCR_DRV_SPDLED_SET(x) (((uint16_t)(x) << DP83848_LEDCR_DRV_SPDLED_SHIFT) & DP83848_LEDCR_DRV_SPDLED_MASK)
#define DP83848_LEDCR_DRV_SPDLED_GET(x) (((uint16_t)(x) & DP83848_LEDCR_DRV_SPDLED_MASK) >> DP83848_LEDCR_DRV_SPDLED_SHIFT)

/*
 * DRV_LNKLED (RW)
 *
 * 1 = Drive value of LNKLED bit onto LED_LINK output
 * 0 = Normal operation
 */
#define DP83848_LEDCR_DRV_LNKLED_MASK (0x10U)
#define DP83848_LEDCR_DRV_LNKLED_SHIFT (4U)
#define DP83848_LEDCR_DRV_LNKLED_SET(x) (((uint16_t)(x) << DP83848_LEDCR_DRV_LNKLED_SHIFT) & DP83848_LEDCR_DRV_LNKLED_MASK)
#define DP83848_LEDCR_DRV_LNKLED_GET(x) (((uint16_t)(x) & DP83848_LEDCR_DRV_LNKLED_MASK) >> DP83848_LEDCR_DRV_LNKLED_SHIFT)

/*
 * SPDLED (RW)
 *
 * Value to force on LED_SPEED output
 */
#define DP83848_LEDCR_SPDLED_MASK (0x4U)
#define DP83848_LEDCR_SPDLED_SHIFT (2U)
#define DP83848_LEDCR_SPDLED_SET(x) (((uint16_t)(x) << DP83848_LEDCR_SPDLED_SHIFT) & DP83848_LEDCR_SPDLED_MASK)
#define DP83848_LEDCR_SPDLED_GET(x) (((uint16_t)(x) & DP83848_LEDCR_SPDLED_MASK) >> DP83848_LEDCR_SPDLED_SHIFT)

/*
 * LNKLED (RW)
 *
 * Value to force on LED_LINK output
 */
#define DP83848_LEDCR_LNKLED_MASK (0x2U)
#define DP83848_LEDCR_LNKLED_SHIFT (1U)
#define DP83848_LEDCR_LNKLED_SET(x) (((uint16_t)(x) << DP83848_LEDCR_LNKLED_SHIFT) & DP83848_LEDCR_LNKLED_MASK)
#define DP83848_LEDCR_LNKLED_GET(x) (((uint16_t)(x) & DP83848_LEDCR_LNKLED_MASK) >> DP83848_LEDCR_LNKLED_SHIFT)

/* Bitfield definition for register: PHYCR */
/*
 * MDIX_EN (RW)
 *
 * Auto-MDIX Enable:
 * 1 = Enable Auto-neg Auto-MDIX capability.
 * 0 = Disable Auto-neg Auto-MDIX capability.
 * The Auto-MDIX algorithm requires that the Auto-Negotiation Enable bit in the BMCR register
 * to be set. If Auto-Negotiation is not enabled, Auto-MDIX should be disabled as well.
 */
#define DP83848_PHYCR_MDIX_EN_MASK (0x8000U)
#define DP83848_PHYCR_MDIX_EN_SHIFT (15U)
#define DP83848_PHYCR_MDIX_EN_SET(x) (((uint16_t)(x) << DP83848_PHYCR_MDIX_EN_SHIFT) & DP83848_PHYCR_MDIX_EN_MASK)
#define DP83848_PHYCR_MDIX_EN_GET(x) (((uint16_t)(x) & DP83848_PHYCR_MDIX_EN_MASK) >> DP83848_PHYCR_MDIX_EN_SHIFT)

