hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83848/hpm_dp83848_regs.h
/*
 * ED_AUTO_UP (RW)
 *
 * Energy Detect Automatic Power Up:
 * Automatically begin power-up sequence when Energy Detect Data Threshold value
 * (EDCR[3:0]) is reached. Alternatively, device could be powered up manually using the
 * ED_MAN bit (ECDR[12]).
 */
#define DP83848_EDCR_ED_AUTO_UP_MASK (0x4000U)
#define DP83848_EDCR_ED_AUTO_UP_SHIFT (14U)
#define DP83848_EDCR_ED_AUTO_UP_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_AUTO_UP_SHIFT) & DP83848_EDCR_ED_AUTO_UP_MASK)
#define DP83848_EDCR_ED_AUTO_UP_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_AUTO_UP_MASK) >> DP83848_EDCR_ED_AUTO_UP_SHIFT)

/*
 * ED_AUTO_DOWN (RW)
 *
 * Energy Detect Automatic Power Down:
 * Automatically begin power-down sequence when no energy is detected. Alternatively,
 * device could be powered down using the ED_MAN bit (EDCR[12]).
 */
#define DP83848_EDCR_ED_AUTO_DOWN_MASK (0x2000U)
#define DP83848_EDCR_ED_AUTO_DOWN_SHIFT (13U)
#define DP83848_EDCR_ED_AUTO_DOWN_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_AUTO_DOWN_SHIFT) & DP83848_EDCR_ED_AUTO_DOWN_MASK)
#define DP83848_EDCR_ED_AUTO_DOWN_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_AUTO_DOWN_MASK) >> DP83848_EDCR_ED_AUTO_DOWN_SHIFT)

/*
 * ED_MAN (RW)
 *
 * Energy Detect Manual Power Up/Down:
 * Begin power-up/down sequence when this bit is asserted. When set, the Energy Detect
 * algorithm will initiate a change of Energy Detect state regardless of threshold (error or
 * data) and timer values.
 */
#define DP83848_EDCR_ED_MAN_MASK (0x1000U)
#define DP83848_EDCR_ED_MAN_SHIFT (12U)
#define DP83848_EDCR_ED_MAN_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_MAN_SHIFT) & DP83848_EDCR_ED_MAN_MASK)
#define DP83848_EDCR_ED_MAN_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_MAN_MASK) >> DP83848_EDCR_ED_MAN_SHIFT)

/*
 * ED_BURST_DIS (RW)
 *
 * Energy Detect Bust Disable:
 * Disable bursting of energy detect data pulses. By default, Energy Detect (ED) transmits
 * a burst of 4 ED data pulses each time the CD is powered up. When bursting is
 * disabled, only a single ED data pulse will be send each time the CD is powered up.
 */
#define DP83848_EDCR_ED_BURST_DIS_MASK (0x800U)
#define DP83848_EDCR_ED_BURST_DIS_SHIFT (11U)
#define DP83848_EDCR_ED_BURST_DIS_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_BURST_DIS_SHIFT) & DP83848_EDCR_ED_BURST_DIS_MASK)
#define DP83848_EDCR_ED_BURST_DIS_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_BURST_DIS_MASK) >> DP83848_EDCR_ED_BURST_DIS_SHIFT)

/*
 * ED_PWR_STATE (RO)
 *
 * Energy Detect Power State:
 * Indicates current Energy Detect Power state. When set, Energy Detect is in the
 * powered up state. When cleared, Energy Detect is in the powered down state. This bit
 * is invalid when Energy Detect is not enabled.
 */
#define DP83848_EDCR_ED_PWR_STATE_MASK (0x400U)
#define DP83848_EDCR_ED_PWR_STATE_SHIFT (10U)
#define DP83848_EDCR_ED_PWR_STATE_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_PWR_STATE_MASK) >> DP83848_EDCR_ED_PWR_STATE_SHIFT)

/*
 * ED_ERR_MET (RO)
 *
 * Energy Detect Error Threshold Met:
 * No action is automatically taken upon receipt of error events. This bit is informational
 * only and would be cleared on a read.
 */
#define DP83848_EDCR_ED_ERR_MET_MASK (0x200U)
#define DP83848_EDCR_ED_ERR_MET_SHIFT (9U)
#define DP83848_EDCR_ED_ERR_MET_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_ERR_MET_MASK) >> DP83848_EDCR_ED_ERR_MET_SHIFT)

/*
 * ED_DATA_MET (RO)
 *
 * Energy Detect Data Threshold Met:
 * The number of data events that occurred met or surpassed the Energy Detect Data
 * Threshold. This bit is cleared on a read.
 */
#define DP83848_EDCR_ED_DATA_MET_MASK (0x100U)
#define DP83848_EDCR_ED_DATA_MET_SHIFT (8U)
#define DP83848_EDCR_ED_DATA_MET_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_DATA_MET_MASK) >> DP83848_EDCR_ED_DATA_MET_SHIFT)

/*
 * ED_ERR_COUNT (RW)
 *
 * Energy Detect Error Threshold:
 * Threshold to determine the number of energy detect error events that should cause the
 * device to take action. Intended to allow averaging of noise that may be on the line.
 * Counter will reset after approximately 2 seconds without any energy detect data
 * events.
 */
#define DP83848_EDCR_ED_ERR_COUNT_MASK (0xF0U)
#define DP83848_EDCR_ED_ERR_COUNT_SHIFT (4U)
#define DP83848_EDCR_ED_ERR_COUNT_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_ERR_COUNT_SHIFT) & DP83848_EDCR_ED_ERR_COUNT_MASK)
#define DP83848_EDCR_ED_ERR_COUNT_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_ERR_COUNT_MASK) >> DP83848_EDCR_ED_ERR_COUNT_SHIFT)

/*
 * ED_DATA_COUNT (RW)
 *
 * Energy Detect Data Threshold:
 * Threshold to determine the number of energy detect events that should cause the
 * device to take actions. Intended to allow averaging of noise that may be on the line.
 * Counter will reset after approximately 2 seconds without any energy detect data
 * events.
 */
#define DP83848_EDCR_ED_DATA_COUNT_MASK (0xFU)
#define DP83848_EDCR_ED_DATA_COUNT_SHIFT (0U)
#define DP83848_EDCR_ED_DATA_COUNT_SET(x) (((uint16_t)(x) << DP83848_EDCR_ED_DATA_COUNT_SHIFT) & DP83848_EDCR_ED_DATA_COUNT_MASK)
#define DP83848_EDCR_ED_DATA_COUNT_GET(x) (((uint16_t)(x) & DP83848_EDCR_ED_DATA_COUNT_MASK) >> DP83848_EDCR_ED_DATA_COUNT_SHIFT)




#endif /* HPM_DP83848_REGS_H */
